In [10]:
import pandas as pd

In [11]:
dataset=pd.read_csv("Preplacement.csv")

In [12]:
dataset

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary,gender,ssc_b,hsc_b,hsc_s,degree_t,workex,specialisation,status
0,1.0,67.00,91.00,58.00,55.0,58.80,270000.000000,M,Others,Others,Commerce,Sci&Tech,No,Mkt&HR,Placed
1,2.0,79.33,78.33,77.48,86.5,66.28,200000.000000,M,Central,Others,Science,Sci&Tech,Yes,Mkt&Fin,Placed
2,3.0,65.00,68.00,64.00,75.0,57.80,250000.000000,M,Central,Central,Arts,Comm&Mgmt,No,Mkt&Fin,Placed
3,4.0,56.00,52.00,52.00,66.0,59.43,288655.405405,M,Central,Central,Science,Sci&Tech,No,Mkt&HR,Not Placed
4,5.0,85.80,73.60,73.30,96.8,55.50,425000.000000,M,Central,Central,Commerce,Comm&Mgmt,No,Mkt&Fin,Placed
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
210,211.0,80.60,82.00,77.60,91.0,74.49,400000.000000,M,Others,Others,Commerce,Comm&Mgmt,No,Mkt&Fin,Placed
211,212.0,58.00,60.00,72.00,74.0,53.62,275000.000000,M,Others,Others,Science,Sci&Tech,No,Mkt&Fin,Placed
212,213.0,67.00,67.00,73.00,59.0,69.72,295000.000000,M,Others,Others,Commerce,Comm&Mgmt,Yes,Mkt&Fin,Placed
213,214.0,74.00,66.00,58.00,70.0,60.23,204000.000000,F,Others,Others,Commerce,Comm&Mgmt,No,Mkt&HR,Placed
214,215.0,62.00,58.00,53.00,89.0,60.22,288655.405405,M,Central,Others,Science,Comm&Mgmt,No,Mkt&HR,Not Placed

In [13]:
dataset.isna().sum()
#no null values

sl_no             0
ssc_p             0
hsc_p             0
degree_p          0
etest_p           0
mba_p             0
salary            0
gender            0
ssc_b             0
hsc_b             0
hsc_s             0
degree_t          0
workex            0
specialisation    0
status            0
dtype: int64

In [14]:
dataset.drop('sl_no',inplace=True,axis=1)
#inplace it will save the data in direct file

In [21]:
dataset.select_dtypes(include="number").cov()
#In our dataset had object data types so we selected only the number data types to get the Covariance
#else we can give only quan cloumns in the dataset

,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
ssc_p,117.228377,60.348373,42.897137,37.659225,24.535952,1.976764e+04
hsc_p,60.348373,118.755706,34.819820,35.461678,22.555846,4.600806e+04
degree_p,42.897137,34.819820,54.151103,21.929469,17.272020,-8.064357e+03
etest_p,37.659225,35.461678,21.929469,176.251018,16.886973,1.571579e+05
mba_p,24.535952,22.555846,17.272020,16.886973,34.028376,6.611551e+04
salary,19767.643976,46008.057275,-8064.357161,157157.850783,66115.509283,5.999726e+09

In [18]:
#ssc_p and hsc_p was mostly diffrent it had 42 diffrents and it's positive covariance 
#less diffrent was 16 diffrent in Etest_p and mba_p and it's positive covariance 
#In degree_p and etest_p co veriance diffrent was 21
#salary cloumn number was very high value so we got more no of diffrent in salary compare with others cloumns

In [20]:
dataset.select_dtypes(include="number").corr()

             ssc_p     hsc_p  degree_p   etest_p     mba_p    salary
ssc_p     1.000000  0.511472  0.538404  0.261993  0.388478  0.023571
hsc_p     0.511472  1.000000  0.434206  0.245113  0.354823  0.054506
degree_p  0.538404  0.434206  1.000000  0.224470  0.402364 -0.014148
etest_p   0.261993  0.245113  0.224470  1.000000  0.218055  0.152829
mba_p     0.388478  0.354823  0.402364  0.218055  1.000000  0.146324
salary    0.023571  0.054506 -0.014148  0.152829  0.146324  1.000000

In [22]:
#here the same columns always in 1 ex:(ssc_p and ssc_p, etest_p and etest_p)
#And same values will get in the same cloumns ex:(ssc_p and hsc_p, hsc_p and ssc_p values was same

In [23]:
# 1 or >0 was positive correlation 
#exactly 0 was zero correlation
#- values was negative correlation

In [24]:
#mba_p and salary correlation was 14% those 2 columns have 14% of relation